var data = {
    list : [
        {
            tip : 'sh',
            text : '社会招聘',
            eng:"society"
        },
        {
            tip : 'xy',
            text : '校园招聘',
            eng:"campus"
        }
    ],
    world: [{
            num: 1,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 2,
            job: "社会招聘",
            pNum: 1000,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 3,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 4,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 5,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 6,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 7,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 8,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 9,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 10,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        },

        {
            num: 11,
            job: "社会招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }
    ],
    school: [{
            num: 1,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 2,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 3,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 4,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 5,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 6,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 7,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 8,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 9,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 10,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        },

        {
            num: 11,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 12,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 13,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 14,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 15,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 16,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 17,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 18,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 19,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 20,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }, {
            num: 21,
            job: "校园招聘",
            pNum: 2,
            ask: "岗位要求：1)helpdesk支持；2)熟悉计算机软、硬件及网络维护；3)有相关工作经验，态度端正；4)有一定的服务意识",
            data: "2014-04-10"
        }
    ]
};
var rightList=document.getElementById("rightList");
			data.world.forEach(function(n,x){
				if(window.listName==11;){
					rightList.innerHTML+=
						`
							<li>
								<span class="num">${data.world[x].num}</span>
								<div class="list">
									<a href=""><span class="job">职位需求：${data.world[x].num}</span><span>需求人数：${data.world[0].pNum}名</span><time>${data.world[x].data}</time></a>
									<p><span class="text">${data.world[x].ask}</span><a href="javascript:;">查看详情>></a></p>
								</div>
							</li>
						`
					}
				}
			)